Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/government_departments/the_civil_service.html.txt.tmx
Source language: en
Languages: ga

source: The civil service are the public officials who advise and assist Government Ministers in the running of their Departments
ga: Is oifigigh phoiblí iad foireann na Státseirbhíse a chuidíonn leis na hAirí Rialtais ina Ranna Rialtais éagsúla

source: The Constitution does not mention the civil service but it is vital to the functioning of the state
ga: Níl an Státseirbhís luaite sa Bhunreacht ach is páirt an-tábhachtach den chóras pairliminte í

source: The civil service has three main functions:
ga: Tá trí phríomh ról ag an Státseirbhís:

source: • It advises the Government on policy
ga: • Cuireann comhairle ar an Rialtas maidir le polasaí

source: • It helps prepare and draft new legislation and
ga: • Cuidíonn siad in ullmhú agus i scríobh reachtaíochta nua agus

source: • It helps the Government to run the country according to the legislation passed by the Oireachtas
ga: • Cabhraíonn siad leis an Rialtas chun an tír a rialú de réir rialacha dleathacha an Oireachtais

source: Each Department of State has a permanent staff consisting of administrative, professional, specialist and technical employees
ga: I ngach Roinn Stáit bíonn foireann oibre buan déanta suas de fhoireann riaracháin, foireann phroifisiúnta, foireann saineolaithe agus foireann teicniúil

source: The head civil servant of each Department is the Secretary General, who is recommended by the Minister for that Department and appointed for a period of 7 years by the Government
ga: I gceannas na státseirbhíseach i ngach Roinn tá Ard Rúnaí a ainmnítear ar chomhairle an Aire Rialtais agus a fhanann sa phost ar feadh tréimhse 7 mbliana

source: Below the Secretary General, there are a number of Assistant Secretaries, who are each responsible for specific areas of work in the Department
ga: Ag leibhéal níos ísle ná an tArd Rúnaí sa státseirbhís tá méid áirithe Rúnaithe Cúnta agus tá gné faoi leith de obair na Roinne faoina gcúram

source: Below the Assistant Secretaries, there are many officials at varying levels of seniority
ga: Síos uaidh sin aríst tá alán grádanna eile de Státseirbhísigh ag leibhéil éagsúla sinsearachta

source: Recruitment to the civil and public service
ga: Earcú chuig an státseirbhís agus an tseirbhís phoiblí

source: The Public Appointments Service provides recruitment, assessment and selection services for the civil service
ga: Cuireann an tSeirbhís um Cheapacháin Phoiblí seirbhísí earcaíochta, measúnaithe agus roghnúcháin ar fáil don státseirbhís

source: They also provide recruitment and consultancy services to local authorities, the Health Service Executive , An Garda Síochána and other public bodies
ga: Cuireann siad seirbhísí earcaíochta agus comhairleoireachta ar fáil d’údaráis áitiúla, don FSS, don Gharda Síochána agus do chomhlachtaí poiblí eile

source: The Commission for Public Service Appointments is a separate body
ga: Is comhlacht ar leith atá sa Choimisiún um Cheapacháin Seirbhíse Poiblí

source: The Commission sets standards, which it publishes as codes of practice, for recruitment and selection to the civil service, An Garda Síochána and a number of public service bodies, including the Health Service Executive
ga: Leagann an Coimisiún síos caighdeáin, a fhoilsíonn sé mar chóid chleachtais, maidir le hearcú agus roghnúchán chuig an státseirbhís, an Garda Síochána, agus roinnt comhlachtaí seirbhíse phoiblí, lena n-áirítear Feidhmeannacht na Seirbhíse Sláinte
